In [4]:
!pip install pandas
import pandas as pd
import numpy as np

Collecting pandas
  Using cached pandas-2.2.3-cp311-cp311-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.23.2 in c:\users\nitro v16\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2.2.5)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\nitro v16\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\nitro v16\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\nitro v16\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\nitro v16\appdata\local\programs\python\python311\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Using cached pandas-2.2.3-cp311-cp311-win_amd64.whl (11.6 MB)
Installing collected packages: pandas
Successfully installed pandas-2.2.3

In [6]:
dict1 = {
    "name" : ['utsav','rohan','sam','saroj'],
    "marks" : [92,34,24,17],
    "city" : ['kathmandu','lumbini','pokhara','bardiya']
}

In [9]:
# changing dict ro dataframe for faster indexing and calculation
df = pd.DataFrame(dict1)

In [12]:
#display content of dataframe
df

    name  marks       city
0  utsav     92  kathmandu
1  rohan     34    lumbini
2    sam     24    pokhara
3  saroj     17    bardiya

In [13]:
#dataframe to excel/csv
df.to_csv('friends.csv')

In [15]:
#to remove index column
df.to_csv('friend_index_falses.csv',index = False)

In [16]:
df.head(2)

    name  marks       city
0  utsav     92  kathmandu
1  rohan     34    lumbini

In [17]:
df.tail(2)

    name  marks     city
2    sam     24  pokhara
3  saroj     17  bardiya

In [19]:
df.describe() #numerical columns only

          marks
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000